rottenpotatoes/app/controllers/movies_controller.rb

  def similar_movies
    @movie = Movie.find(params[:id])
    movie_director = @movie.director
    if movie_director.empty? then
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.where(Director: movie_director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'